# Ultralytics 🚀 AGPL-3.0 License
nc: 80  # number of classes
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# Backbone（保持不变）
backbone:
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2 [3->64]
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4 [64->128]
  - [-1, 3, C2f, [128, True]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8 [128->256]
  - [-1, 6, C2f, [256, True]]      # 4
  - [-1, 1, Conv, [512, 3, 2]]     # 5-P4/16 [256->512]
  - [-1, 6, C2f, [512, True]]      # 6
  - [-1, 1, Conv, [1024, 3, 2]]    # 7-P5/32 [512->1024]
  - [-1, 3, C2f, [1024, True]]     # 8
  - [-1, 1, SPPF, [1024, 5]]       # 9（P5/32，1024通道）

# Head（修正融合逻辑、参数和尺寸）
head:
  # 融合P5与P4（同尺度）
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 10：P5/32→P4/16（1024通道）
  - [[-1, 6], 1, Concat_BiFPN, [1]]  # 11：融合层14（1024）和层9（512），输出512
  - [-1, 3, C2f, [512]]  # 12（P4/16，512通道）

  # 融合P4与P3（同尺度）
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 13：P4/16→P3/8（512通道）
  - [[-1, 4], 1, Concat_BiFPN, [1]]  # 14：融合层17（512）和层6（256），输出256
  - [-1, 3, C2f, [256]]  # 15（P3/8，256通道）

  # 融合P3与P4（同尺度）
  - [-1, 1, Conv, [256, 3, 2]]  # 16：P3/8→P4/16（256通道）
  - [[-1, 12], 1, Concat_BiFPN, [1]]  # 17：融合层20（256）和层16（512），输出512
  - [-1, 3, C2f, [512]]  # 18（P4/16，512通道）

  # 融合P4与P5（同尺度）
  - [-1, 1, Conv, [512, 3, 2]]  # 19：P4/16→P5/32（512通道）
  - [[-1, 9], 1, Concat_BiFPN, [1]]  # 20：融合层23（512）和层13（1024），输出1024
  - [-1, 3, C2f, [1024]]  # 12（P5/32，1024通道）
  
  # 输出层（通道匹配）
  - [[15, 18, 21], 1, Segment, [nc, 32, 256]]  # 26：P3(256)、P4(512)、P5(1024)
